In [2]:
import sqlite3
import pandas as pd

In [3]:
# conexion a base de datos. Si la base de datos no está la crea
conn = sqlite3.connect("FARMSPACE.db")
print("Opened database successfully")
conn

Opened database successfully

In [4]:
#Creating a cursor object using the cursor() method
cursor = conn.cursor()

In [82]:
# Commit your changes in the database
conn.commit()
#Closing the connection
conn.close()

### INCLUIR PRODUCTORES

In [ ]:
#Creating table as per requirement
productor = '''CREATE TABLE productor
         (productorID     INT     AUTO_INCREMENT      PRIMARY KEY     NOT NULL,
         razonSocial        VARCHAR(100)                                NULL,
         nombreComercial    VARCHAR(100)                                NULL)
         '''
cursor.execute(productor)
print("Table created successfully")

In [5]:
df = pd.read_csv("/Users/elsa/Desktop/Bootcamp The Bridge/The_Bridge/Ds_Bootcamp_Elsa/Ejercicios/Desafío de tripulaciones/Proyecto/csv_para_base_datos/productores_id.csv")
df

,id_productor,RAZON_SOCIAL,NOMBRE_COMERCIAL
0,1,QUIROZ ALVEAR GERMAN FRANCISCO,Null
1,2,DONOSO JARAMILLO JOSE FERNANDO,FINCA EL PARAISO
2,3,DONOSO JARAMILLO JOSE FERNANDO,FINCA EL PARAISO
3,4,DONOSO JARAMILLO JOSE FERNANDO,FINCA EL PARAISO
4,5,DONOSO JARAMILLO JOSE FERNANDO,FINCA EL PARAISO
...,...,...,...
3386,3387,SARMIENTO GUALLPA MANUEL LEONARDO,FINCA HERMANOS SARMIENTO
3387,3388,PEREZ QUEZADA CARLOS FRANCISCO,Null
3388,3389,LOPEZ VILLEGAS MILTON MARCELO,Null
3389,3390,PILA PUJOTA SEGUNDO SANTOS,Null
3390,3391,ZILOAGRO CIA LTDA,Null

In [ ]:
df.to_sql(productor, con = conn)

In [7]:
# Commit your changes in the database
conn.commit()

### INCLUIR PRODUCTOS

In [37]:
#Creating table as per requirement
producto = '''CREATE TABLE producto
         (CIIU     VARCHAR(15)      PRIMARY KEY     NOT NULL,
         producto  VARCHAR(100)             NOT NULL,
         IPP       INT                          NULL, 
         IPC       INT                          NULL)
         '''
cursor.execute(producto)
print("Table created successfully")

Table created successfully

In [35]:
df1 = pd.read_csv("/Users/elsa/Desktop/Bootcamp The Bridge/The_Bridge/Ds_Bootcamp_Elsa/Ejercicios/Desafío de tripulaciones/Proyecto/csv_para_base_datos/productos_id.csv")
df1.head()

      CIIU                                           producto     IPP     IPC
0  A011601                       CULTIVO DE SANDÍAS, MELONES.  1.1220  1.6830
1  A012201                     CULTIVO DE BANANOS Y PLÁTANOS.  0.2990  0.4485
2  A012801  CULTIVO DE ESPECIAS DEL GÉNERO CAPSICUM: AJÍES...  0.3917  0.5876
3  A011122                                 CULTIVO DE ARVEJA.  0.4743  0.7114
4  A021002  CULTIVO DE MONTE BAJO (ARBUSTOS), MADERA PARA ...  1.2901  1.9352

In [ ]:
df1.to_sql("producto", con = conn)

In [11]:
# Commit your changes in the database
conn.commit()

### INCLUIR PRODUCTORES_PRODUCTOS

In [13]:
#Creating table as per requirement
productorProducto = '''CREATE TABLE productorProducto
        (productorID       INT    AUTO_INCREMENT  NOT NULL,
        CIIU               VARCHAR(15)              NOT NULL,
        precioConsumidor  INT                          NULL, 
        KgProductor       INT                          NULL,
        PRIMARY KEY (productorID),
        FOREIGN KEY (CIIU) REFERENCES productos(CIIU))
        '''
cursor.execute(productorProducto)
print("Table created successfully")

Table created successfully

In [ ]:
CREATE TABLE productores-producto (
    productorID       INT    AUTO_INCREMENT    NOT NULL,
    CIIU               VARCHAR(15)              NOT NULL,
    precio_consumidor  INT                          NULL, 
    Kg_productor       INT                          NULL,
    PRIMARY KEY (id_productor),
    FOREIGN KEY (CIIU) REFERENCES productos(CIIU)
);

In [14]:
df2 = pd.read_csv("/Users/elsa/Desktop/Bootcamp The Bridge/The_Bridge/Ds_Bootcamp_Elsa/Ejercicios/Desafío de tripulaciones/Proyecto/csv_para_base_datos/productor_producto_id.csv")
df2.head()

   id_productor     CIIU  precio_consumidor  Kg_productor
0             1  A012601             2.5196      162719.0
1             2  A012701             0.4925        6030.0
2             3  A012701             0.4925        6030.0
3             4  A012701             0.4925        6030.0
4             5  A012701             0.4925        6030.0

In [ ]:
df2.to_sql(productorProducto, con = conn)

In [16]:
# Commit your changes in the database
conn.commit()

### INCLUIR DIRECCIONES

In [ ]:
CREATE TABLE direccion (
    id INT NOT NULL PRIMARY KEY AUTO_INCREMENT,
    idExterno INT NULL,
    Calle VARCHAR(100) NULL,
    Numero VARCHAR(100) NULL,
    Interseccion VARCHAR(100) NULL,
    DescripcionProvincia VARCHAR(100) NULL,
    DescripcionCanton VARCHAR(100) NULL,   
);

direccion.nombreDireccion

### No agregar

In [38]:
#Creating table as per requirement
direccion = '''CREATE TABLE direccion
         (productorID     INT     AUTO_INCREMENT      PRIMARY KEY     NOT NULL,
         CALLE                  VARCHAR(100)                                NULL,
         NUMERO                 VARCHAR(100)                                NULL,
         INTERSECCION           VARCHAR(100)                                NULL,
         DESCRIPCION_PROVINCIA  VARCHAR(100)                                NULL,
         DESCRIPCION_CANTON     VARCHAR(100)                                NULL)
         '''
cursor.execute(direccion)
print("Table created successfully")

Table created successfully

In [39]:
df3 = pd.read_csv("/Users/elsa/Desktop/Bootcamp The Bridge/The_Bridge/Ds_Bootcamp_Elsa/Ejercicios/Desafío de tripulaciones/Proyecto/csv_para_base_datos/direccion_sinCoordenadas_id.csv")
df3.head()

,id_productor,CALLE,NUMERO,INTERSECCION,DESCRIPCION_PROVINCIA,DESCRIPCION_CANTON
0,1,VIA A PUERTO QUITO,S/N,MARGEN IZQUIERDO,PICHINCHA,PUERTO QUITO
1,2,MEDARDO SILVA,S4-252,AURORA ESTRADA,PICHINCHA,QUITO
2,3,VIA SANTA ELENA,LT 1,Null,PICHINCHA,QUITO
3,4,VIA SAN DIMAS,S/N,MARGEN IZQUIERDO,PICHINCHA,PEDRO VICENTE MALDONADO
4,5,MEDARDO SILVA,S-4 252,AURORA ESTRADA,PICHINCHA,QUITO

In [41]:
df3.to_sql("direccion", con = conn)

In [42]:
# Commit your changes in the database
conn.commit()

### Agregar

#### direcciones con coordenadas canton

In [10]:
#Creating table as per requirement
direcciones = '''CREATE TABLE direcciones
         (productorID     INT     AUTO_INCREMENT      PRIMARY KEY     NOT NULL,
         calle                  VARCHAR(100)                                NULL,
         numero                 VARCHAR(100)                                NULL,
         interseccion           VARCHAR(100)                                NULL,
         descripcionProvincia   VARCHAR(100)                                NULL,
         descripcionCanton      VARCHAR(100)                                NULL,
         latitud                INT                                         NULL,
         longitud               INT                                         NULL)
         '''
cursor.execute(direcciones)
print("Table created successfully")

Table created successfully

In [ ]:
.loc[:,["Latitud","Longitud"]]

In [11]:
dfCoor = pd.read_csv("/Users/elsa/Desktop/Bootcamp The Bridge/The_Bridge/Ds_Bootcamp_Elsa/Ejercicios/Desafío de tripulaciones/Proyecto/csv_para_base_datos/direccion_id.csv")
dfCoor

,id_productor,CALLE,NUMERO,INTERSECCION,DESCRIPCION_PROVINCIA,DESCRIPCION_CANTON,Latitud,Longitud
0,1,VIA A PUERTO QUITO,S/N,MARGEN IZQUIERDO,PICHINCHA,PUERTO QUITO,0.160887,-79.226730
1,2,MEDARDO SILVA,S4-252,AURORA ESTRADA,PICHINCHA,QUITO,-0.220164,-78.512327
2,3,VIA SANTA ELENA,LT 1,Null,PICHINCHA,QUITO,-0.220164,-78.512327
3,4,VIA SAN DIMAS,S/N,MARGEN IZQUIERDO,PICHINCHA,PEDRO VICENTE MALDONADO,0.086496,-79.052577
4,5,MEDARDO SILVA,S-4 252,AURORA ESTRADA,PICHINCHA,QUITO,-0.220164,-78.512327
...,...,...,...,...,...,...,...,...
3386,3387,PACHECO,OE6-144,JUAN GARZON,PICHINCHA,QUITO,-0.220164,-78.512327
3387,3388,VIA A LA RUTA DOS,S/N,MARGEN IZQUIERDO,PICHINCHA,PUERTO QUITO,0.160887,-79.226730
3388,3389,VIA LA SEXTA,S/N,MARGEN IZQUIERDO,PICHINCHA,PUERTO QUITO,0.160887,-79.226730
3389,3390,PRINCIPAL,Null,Null,PICHINCHA,PEDRO MONCAYO,-0.214998,-78.496884
3390,3391,DIEGO VELASQUEZ,OE4-122,JHON F KENNEDY,PICHINCHA,QUITO,-0.220164,-78.512327

In [12]:
dfCoor.to_sql(direcciones, con = conn)

In [13]:
# Commit your changes in the database
conn.commit()

### INCLUIR CONSUMIDORES

In [ ]:
CREATE TABLE consumidores (
    id INT NOT NULL PRIMARY KEY AUTO_INCREMENT,
    idExterno INT NULL,
    NombreCliente VARCHAR(100) NULL,
    UsernameCliente VARCHAR(20) NULL,
    e.mail(30) VARCHAR(20) NULL,
    contraseña VARCHAR(20) NULL
);

consumidores.nombreConsumidores

In [21]:
#Creating table as per requirement
consumidor = '''CREATE TABLE consumidor
        (clienteID     INT     AUTO_INCREMENT   PRIMARY KEY  NOT NULL,
         NombreCliente          VARCHAR(100)                      NULL,
         UsernameCliente        VARCHAR(100)                      NULL,
         eMail                 VARCHAR(100)                       NULL,
         contraseña             VARCHAR(100)                       NULL)
         '''
cursor.execute(consumidor)
print("Table created successfully")

Table created successfully

In [22]:
df4 = pd.read_csv("/Users/elsa/Desktop/Bootcamp The Bridge/The_Bridge/Ds_Bootcamp_Elsa/Ejercicios/Desafío de tripulaciones/Proyecto/csv_para_base_datos/consumidores_id.csv",sep=",")
df4.head()

,idExterno,NombreCliente,UsernameCliente,e-mail,contraseña
0,1,MARIA CARMEN,sofilascano,sofilascano@hotmail.com,sofilascano
1,2,MARIA,Att.Cliente.Jazztel,Att.Cliente.Jazztel@jazztel.com,Att.Cliente.Jazztel
2,3,CARMEN,bisakson,bisakson@hotmail.com,bisakson
3,4,JOSEFA,emision.internacional,emision.internacional@tam.com.br,emision.internacional
4,5,ISABEL,j.pereyraramos,j.pereyraramos@yahoo.com.ar,j.pereyraramos

In [ ]:
df4.to_sql(consumidor, con = conn)

In [24]:
# Commit your changes in the database
conn.commit()

# @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

In [ ]:
# COMPROBAR QUE LA BASE FUNCIONA

In [124]:
# query """ es un string multinea
query = """
SELECT *
FROM consumidor
"""
pd.read_sql_query(query, conn)

Empty DataFrame
Columns: [clienteID, NombreCliente, UsernameCliente, eMail, contraseña]
Index: []

In [69]:
query =  """
SELECT 	*
FROM productor p
JOIN productorProducto pp ON p.productorID  = pp.productorID
"""
pd.read_sql_query(query, conn)

,index,productorID,razonSocial,nombreComercial,index,productorID,CIIU,precioConsumidor,KgProductor
0,0,1,QUIROZ ALVEAR GERMAN FRANCISCO,Null,0,1,A012601,2.5196,162719.0
1,0,1,QUIROZ ALVEAR GERMAN FRANCISCO,Null,90,1,A012601,2.5196,162719.0
2,0,1,QUIROZ ALVEAR GERMAN FRANCISCO,Null,100,1,A012702,3.4956,20451.0
3,0,1,QUIROZ ALVEAR GERMAN FRANCISCO,Null,200,1,A012201,0.5382,2930466.0
4,0,1,QUIROZ ALVEAR GERMAN FRANCISCO,Null,300,1,A012601,2.5196,162719.0
...,...,...,...,...,...,...,...,...,...
8732,3386,3387,SARMIENTO GUALLPA MANUEL LEONARDO,FINCA HERMANOS SARMIENTO,3386,3387,A012702,3.4956,20451.0
8733,3387,3388,PEREZ QUEZADA CARLOS FRANCISCO,Null,3387,3388,A012702,3.4956,20451.0
8734,3388,3389,LOPEZ VILLEGAS MILTON MARCELO,Null,3388,3389,A012702,3.4956,20451.0
8735,3389,3390,PILA PUJOTA SEGUNDO SANTOS,Null,3389,3390,A011903,0.5166,54512.0
8736,3390,3391,ZILOAGRO CIA LTDA,Null,3390,3391,A011112,0.4855,44191.0

In [ ]:
cursor.execute('''CREATE TABLE ContactEmployee(
  ContactEmployeeID INTEGER PRIMARY KEY, 
  ContactID INTEGER, EmployeeID INTEGER, 
  ContactDate NUMERIC, 
  Description TEXT,  
  FOREIGN KEY(ContactID) REFERENCES Contact(ContactID), 
  FOREIGN KEY(EmployeeID) REFERENCES Employee(EmployeeID))
  ''')
db.commit()